<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Paths
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các đường dẫn mà bạn muốn cấu hình CORS cho nó.
    | Đặt dấu "*" để áp dụng cho tất cả các đường dẫn.
    |
    */

    'paths' => ['api/*'],

    /*
    |--------------------------------------------------------------------------
    | Allowed Methods
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các phương thức HTTP mà bạn muốn cho phép từ các nguồn khác.
    |
    */

    'allowed_methods' => ['*'],

    /*
    |--------------------------------------------------------------------------
    | Allowed Origins
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các nguồn mà bạn muốn cho phép truy cập tài nguyên của bạn.
    | Đặt dấu "*" để cho phép tất cả các nguồn.
    |
    */

    'allowed_origins' => ['*'],

    /*
    |--------------------------------------------------------------------------
    | Allowed Origins Patterns
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các mẫu nguồn mà bạn muốn cho phép. 
    | Dành cho những nguồn có tên miền động.
    |
    */

    'allowed_origins_patterns' => [],

    /*
    |--------------------------------------------------------------------------
    | Allowed Headers
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các tiêu đề HTTP mà bạn muốn cho phép từ các nguồn khác.
    | Đặt dấu "*" để cho phép tất cả các tiêu đề.
    |
    */

    'allowed_headers' => ['*'],

    /*
    |--------------------------------------------------------------------------
    | Exposed Headers
    |--------------------------------------------------------------------------
    |
    | Đây là danh sách các tiêu đề HTTP mà bạn muốn hiển thị trong phản hồi.
    |
    */

    'exposed_headers' => [],

    /*
    |--------------------------------------------------------------------------
    | Max Age
    |--------------------------------------------------------------------------
    |
    | Thời gian (tính bằng giây) mà các phản hồi CORS sẽ được lưu trong cache.
    |
    */

    'max_age' => 0,

    /*
    |--------------------------------------------------------------------------
    | Supports Credentials
    |--------------------------------------------------------------------------
    |
    | Xác định xem phản hồi CORS có thể chứa thông tin xác thực (cookie, HTTP Auth).
    |
    */

    'supports_credentials' => false,

];
